# pandas(2)

## 데이터 연산

In [5]:
import numpy as np
import pandas as pd

s1 = pd.Series([1, 2, 3, 4, 5])
s2 = pd.Series([10, 20, 30, 40, 50])

In [6]:
s1 + s2

0    11
1    22
2    33
3    44
4    55
dtype: int64

In [10]:
s2 - s1

0     9
1    18
2    27
3    36
4    45
dtype: int64

In [8]:
s1 * s2

0     10
1     40
2     90
3    160
4    250
dtype: int64

In [11]:
s2 / s1 # float 형태로 반환

0    10.0
1    10.0
2    10.0
3    10.0
4    10.0
dtype: float64

#### 데이터 크기가 다른 경우: NaN 처리

In [12]:
s3 = pd.Series([1, 2, 3, 4])
s4 = pd.Series([10, 20, 30, 40, 50])

In [13]:
s3 + s4

0    11.0
1    22.0
2    33.0
3    44.0
4     NaN
dtype: float64

In [14]:
s4 - s3

0     9.0
1    18.0
2    27.0
3    36.0
4     NaN
dtype: float64

In [15]:
s3 * s4

0     10.0
1     40.0
2     90.0
3    160.0
4      NaN
dtype: float64

In [16]:
s4 / s3

0    10.0
1    10.0
2    10.0
3    10.0
4     NaN
dtype: float64

In [17]:
table_data1 = {'A': [1, 2, 3, 4, 5],
              'B' : [10, 20, 30, 40, 50],
              'C' : [100, 200, 300, 400, 500]}
df1 = pd.DataFrame(table_data1)
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [18]:
table_data2 = {'A': [6, 7, 8],
              'B' : [60, 70, 80],
              'C' : [600, 700, 800]}
df2 = pd.DataFrame(table_data2)
df2

   A   B    C
0  6  60  600
1  7  70  700
2  8  80  800

In [19]:
# dt1과 dt2는 길이가 같지 않이도 데이터 연산이 됨. 연산 가능한 항목끼리 연산하고 나머지는 NaN

df1 + df2

      A      B       C
0   7.0   70.0   700.0
1   9.0   90.0   900.0
2  11.0  110.0  1100.0
3   NaN    NaN     NaN
4   NaN    NaN     NaN

### 통계

- sum(), mean(), std(), var(), min(), max(), cumsum(), cumprod()
- 합계, 평균, 표준편차, 분산, 최소값, 최대값, 누적 합, 누적 곱


- describe() : count, mean, std, min, 25%, 50%, 75%, max 값을 한번에 추출

In [20]:
table_data3 = {'봄' : [256.5, 264.3, 215.9, 223.2, 312.8],
              '여름': [770.6, 567.5, 599.8, 387.1, 446.2],
              '가을': [363.5, 231.2, 293.1, 247.7, 381.6],
              '겨울': [139.3, 59.9, 76.9, 109.1, 108.1]}
column_list = ['봄','여름','가을','겨울']
index_list = ['2012','2013','2014','2015','2016']

df3 = pd.DataFrame(table_data3, columns = column_list, index = index_list)
df3

          봄     여름     가을     겨울
2012  256.5  770.6  363.5  139.3
2013  264.3  567.5  231.2   59.9
2014  215.9  599.8  293.1   76.9
2015  223.2  387.1  247.7  109.1
2016  312.8  446.2  381.6  108.1

In [22]:
df3.mean()

봄     254.54
여름    554.24
가을    303.42
겨울     98.66
dtype: float64

In [23]:
df3.std()

봄      38.628267
여름    148.888895
가을     67.358496
겨울     30.925523
dtype: float64

#### 연도별 평균 강수량과 표준편차

- axis=0 : 열 별로 연산 수행 (default)
- axis=1 : 행별로 연산 수행

In [24]:
df3.mean(axis=1)

2012    382.475
2013    280.725
2014    296.425
2015    241.775
2016    312.175
dtype: float64

In [25]:
df3.std(axis=1)

2012    274.472128
2013    211.128782
2014    221.150739
2015    114.166760
2016    146.548658
dtype: float64

In [26]:
df3.std(axis=0)  # default값과 동일

봄      38.628267
여름    148.888895
가을     67.358496
겨울     30.925523
dtype: float64

In [28]:
# 한번에 구하기

df3.describe()

                봄          여름          가을          겨울
count    5.000000    5.000000    5.000000    5.000000
mean   254.540000  554.240000  303.420000   98.660000
std     38.628267  148.888895   67.358496   30.925523
min    215.900000  387.100000  231.200000   59.900000
25%    223.200000  446.200000  247.700000   76.900000
50%    256.500000  567.500000  293.100000  108.100000
75%    264.300000  599.800000  363.500000  109.100000
max    312.800000  770.600000  381.600000  139.300000

In [29]:
df3.T.describe()   # Transpose

             2012        2013        2014       2015        2016
count    4.000000    4.000000    4.000000    4.00000    4.000000
mean   382.475000  280.725000  296.425000  241.77500  312.175000
std    274.472128  211.128782  221.150739  114.16676  146.548658
min    139.300000   59.900000   76.900000  109.10000  108.100000
25%    227.200000  188.375000  181.150000  194.67500  261.625000
50%    310.000000  247.750000  254.500000  235.45000  347.200000
75%    465.275000  340.100000  369.775000  282.55000  397.750000
max    770.600000  567.500000  599.800000  387.10000  446.200000

### 원하는 데이터 선택하기(1)

- DataFrame_data.head([n])
- DataFrame_data.tail([n])
- DataFrame_data[행_시작_위치:행_끝_위치-1]
- DataFrame_data.loc[index_name]               # 문자열로 넣은 경우 문자열 형태로 입력
- **DataFrame_data.loc[start_index_name:end_index_name]** # 실제 대용량 데이터에서는 가장 유용

In [51]:
import numpy as np
import pandas as pd

KTX_data = {'경부선 KTX': [39060, 39896, 42005, 43621, 41702, 41266, 32427],
            '호남선 KTX': [7313, 6967, 6873, 6626, 8675, 10622, 9228],
            '경전선 KTX': [3627, 4168, 4088, 4424, 4606, 4984, 5570],
            '전라선 KTX': [309, 1771, 1954, 2244, 3146, 3945, 5766],
            '동해선 KTX': [np.nan,np.nan, np.nan, np.nan, 2395, 3786, 6667]}
col_list = ['경부선 KTX','호남선 KTX','경전선 KTX','전라선 KTX','동해선 KTX']
index_list = ['2011','2012','2013','2014','2015','2016','2017']

df_KTX = pd.DataFrame(KTX_data, columns = col_list, index = index_list)
df_KTX

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

In [36]:
df_KTX.index

Index(['2011', '2012', '2013', '2014', '2015', '2016', '2017'], dtype='object')

In [37]:
df_KTX.columns

Index(['경부선 KTX', '호남선 KTX', '경전선 KTX', '전라선 KTX', '동해선 KTX'], dtype='object')

In [38]:
df_KTX.values

array([[39060.,  7313.,  3627.,   309.,    nan],
       [39896.,  6967.,  4168.,  1771.,    nan],
       [42005.,  6873.,  4088.,  1954.,    nan],
       [43621.,  6626.,  4424.,  2244.,    nan],
       [41702.,  8675.,  4606.,  3146.,  2395.],
       [41266., 10622.,  4984.,  3945.,  3786.],
       [32427.,  9228.,  5570.,  5766.,  6667.]])

In [39]:
df_KTX.head() # 지정하지 않으면 기본 5

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0

In [40]:
df_KTX.tail()

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

In [41]:
df_KTX.tail(3)

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

In [42]:
df_KTX[1:2] # 1 ~ (2-1) 까지 추출이므로 1개의 행 데이터만 선택

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2012    39896     6967     4168     1771      NaN

In [43]:
df_KTX[2:5]

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0

In [44]:
df_KTX.loc['2011']

경부선 KTX    39060.0
호남선 KTX     7313.0
경전선 KTX     3627.0
전라선 KTX      309.0
동해선 KTX        NaN
Name: 2011, dtype: float64

In [46]:
df_KTX.loc['2013':'2016']

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0

### 원하는 데이터 선택하기(2)


- DataFrame_data[column_name]
- DataFrame_data[column_name][start_index_name:end_index_name] # 선택한 열에서 원하는 범위의 행 데이터만 추출
- DataFrame_data[column_name][start_index_pos:end_index_pos]

In [48]:
df_KTX['경부선 KTX']

2011    39060
2012    39896
2013    42005
2014    43621
2015    41702
2016    41266
2017    32427
Name: 경부선 KTX, dtype: int64

In [49]:
df_KTX['경부선 KTX']['2012':'2014']

2012    39896
2013    42005
2014    43621
Name: 경부선 KTX, dtype: int64

In [50]:
df_KTX['경부선 KTX'][2:5]

2013    42005
2014    43621
2015    41702
Name: 경부선 KTX, dtype: int64

### 원하는 데이터 선택하기(3)  


- DataFrame_data.loc[index_name][column_name]
- DataFrame_data.loc[index_name, column_name]
- DataFrame_data.[column_name][index_name]
- DataFrame_data.[column_name][index_pos]
- DataFrame_data.[column_name].loc[index_name]

In [52]:
df_KTX.loc['2016']['호남선 KTX']

10622.0

In [67]:
type(df_KTX.loc['2016']['호남선 KTX'])

numpy.float64

In [53]:
df_KTX.loc['2016', '호남선 KTX']

10622

In [68]:
type(df_KTX.loc['2016', '호남선 KTX'])

numpy.int64

In [55]:
df_KTX['호남선 KTX']['2016']

10622

In [56]:
df_KTX['호남선 KTX'][5]

10622

In [58]:
df_KTX['호남선 KTX'].loc['2016']

10622

In [65]:
df_KTX.T  # 열/행 바꾸기

            2011     2012     2013     2014     2015     2016     2017
경부선 KTX  39060.0  39896.0  42005.0  43621.0  41702.0  41266.0  32427.0
호남선 KTX   7313.0   6967.0   6873.0   6626.0   8675.0  10622.0   9228.0
경전선 KTX   3627.0   4168.0   4088.0   4424.0   4606.0   4984.0   5570.0
전라선 KTX    309.0   1771.0   1954.0   2244.0   3146.0   3945.0   5766.0
동해선 KTX      NaN      NaN      NaN      NaN   2395.0   3786.0   6667.0

In [61]:
df_KTX

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

In [64]:
df_KTX[['동해선 KTX','전라선 KTX','경전선 KTX','호남선 KTX','경부선 KTX']] # 열 순서 바꾸기

      동해선 KTX  전라선 KTX  경전선 KTX  호남선 KTX  경부선 KTX
2011      NaN      309     3627     7313    39060
2012      NaN     1771     4168     6967    39896
2013      NaN     1954     4088     6873    42005
2014      NaN     2244     4424     6626    43621
2015   2395.0     3146     4606     8675    41702
2016   3786.0     3945     4984    10622    41266
2017   6667.0     5766     5570     9228    32427

In [70]:
df_KTX['동해선 KTX']['2011']

nan

In [71]:
type(df_KTX['동해선 KTX']['2011'])

numpy.float64

## 데이터 통합하기


- 각 DataFrame 데이터의 인덱스는 변경되지 않는다.

In [80]:
import pandas as pd
import numpy as np

df1 = pd.DataFrame({'Class1': [95, 92, 98, 100],
                   'Class2': [91, 93, 97, 99]})
df1

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99

In [81]:
df2 = pd.DataFrame({'Class1': [87, 89],
                   'Class2': [85, 90]})
df2

   Class1  Class2
0      87      85
1      89      90

In [82]:
df1.append(df2)    # index는 각 데이터의 것을 불러옴

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99
0      87      85
1      89      90

In [83]:
df1.append(df2, ignore_index=True) # index 이어쓰기

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99
4      87      85
5      89      90

In [84]:
df3 = pd.DataFrame({'Class1': [96, 83]})
df3

   Class1
0      96
1      83

In [87]:
df2.append(df3, ignore_index=True)

C:\Anaconda3\envs\python36\lib\site-packages\pandas\core\frame.py:6692: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort)

   Class1  Class2
0      87    85.0
1      89    90.0
2      96     NaN
3      83     NaN

In [88]:
df4 = pd.DataFrame({'Class3': [93, 91, 95, 98]})
df4

   Class3
0      93
1      91
2      95
3      98

In [89]:
df1.join(df4)  # df1에 df4를 가로방향으로 추가 통합(우측에 추가)

   Class1  Class2  Class3
0      95      91      93
1      92      93      91
2      98      97      95
3     100      99      98

In [90]:
index_label = ['a','b','c','d']
df1a = pd.DataFrame({'Class1': [95, 92, 98, 100],
                   'Class2': [91, 93, 97, 99]}, index = index_label)
df4a = pd.DataFrame({'Class3': [93, 91, 95, 98]}, index = index_label)

df1a.join(df4a)  # index가 index_label로 변경되면서 우측으로 자료 추가

   Class1  Class2  Class3
a      95      91      93
b      92      93      91
c      98      97      95
d     100      99      98

In [91]:
df5 = pd.DataFrame({'Class4' : [82, 92]})
df5

   Class4
0      82
1      92

In [92]:
df1.join(df5) # 데이터가 없는 부분은 NaN 처리

   Class1  Class2  Class4
0      95      91    82.0
1      92      93    92.0
2      98      97     NaN
3     100      99     NaN

### 특정 열을 기준으로 통합하기

In [93]:
df_A_B = pd.DataFrame({'판매월': ['1월','2월','3월','4월'],
                      '제품A': [100, 150, 200, 130],
                      '제품B': [90, 110, 140, 170]})
df_A_B

  판매월  제품A  제품B
0  1월  100   90
1  2월  150  110
2  3월  200  140
3  4월  130  170

In [94]:
df_C_D = pd.DataFrame({'판매월': ['1월','2월','3월','4월'],
                      '제품C': [100, 150, 200, 130],
                      '제품D': [90, 110, 140, 170]})
df_C_D

  판매월  제품C  제품D
0  1월  100   90
1  2월  150  110
2  3월  200  140
3  4월  130  170

In [95]:
df_A_B.merge(df_C_D)  # df_A_B 와 DF_C_D 에 모두 있는 '판매월' 열을 중심으로 데이터 통합

  판매월  제품A  제품B  제품C  제품D
0  1월  100   90  100   90
1  2월  150  110  150  110
2  3월  200  140  200  140
3  4월  130  170  130  170

#### 일부 공통된 값을 갖는 경우 통합: merge

In [96]:
df_left = pd.DataFrame({'key':['A','B','C'], 'left':[1,2,3]})
df_left

  key  left
0   A     1
1   B     2
2   C     3

In [97]:
df_right = pd.DataFrame({'key':['A','B','D'], 'right':[4, 5, 6]})
df_right

  key  right
0   A      4
1   B      5
2   D      6

In [98]:
df_left.merge(df_right, how ='left', on = 'key')

  key  left  right
0   A     1    4.0
1   B     2    5.0
2   C     3    NaN

In [99]:
df_left.merge(df_right, how ='right', on = 'key')

  key  left  right
0   A   1.0      4
1   B   2.0      5
2   D   NaN      6

In [100]:
df_left.merge(df_right, how ='outer', on = 'key')  # 합집합

  key  left  right
0   A   1.0    4.0
1   B   2.0    5.0
2   C   3.0    NaN
3   D   NaN    6.0

In [101]:
df_left.merge(df_right, how ='inner', on = 'key')  # 교집합

  key  left  right
0   A     1      4
1   B     2      5

## 데이터파일을 읽고 쓰기

- %%writefile C:\myPyCode\data\[파일명].csv 으로 파일 생성
- pd.read_csv(file_name [,options]) 로 파일 불러오기

In [102]:
%%writefile C:\myPyCode\data\sea_rain1.csv
연도,동해,남해,서해,전체
1996,17.4629,17.2288,14.436,15.9067
1997,17.4116,17.4092,14.8248,16.1526
1998,17.5944,18.011,15.2512,16.6044
1999,18.1495,18.3175,14.8979,16.6284
2000,17.9288,18.1766,15.0504,16.6178

Writing C:\myPyCode\data\sea_rain1.csv

In [103]:
import pandas as pd

pd.read_csv('C:\myPyCode\data\sea_rain1.csv')  # 문자열로 삽입됨.

     연도       동해       남해       서해       전체
0  1996  17.4629  17.2288  14.4360  15.9067
1  1997  17.4116  17.4092  14.8248  16.1526
2  1998  17.5944  18.0110  15.2512  16.6044
3  1999  18.1495  18.3175  14.8979  16.6284
4  2000  17.9288  18.1766  15.0504  16.6178

#### 메모장으로 저장한 csv 파일

In [104]:
pd.read_csv('C:/myPyCode/data/sea_rain1_from_notepad.csv', encoding = "cp949")

     연도       동해       남해       서해       전체
0  1996  17.4629  17.2288  14.4360  15.9067
1  1997  17.4116  17.4092  14.8248  16.1526
2  1998  17.5944  18.0110  15.2512  16.6044
3  1999  18.1495  18.3175  14.8979  16.6284
4  2000  17.9288  18.1766  15.0504  16.6178

In [109]:
%%writefile C:\myPyCode\data\sea_rain1_space.txt
연도 동해 남해 서해 전체
1996 17.4629 17.2288 14.436 15.9067
1997 17.4116 17.4092 14.8248 16.1526
1998 17.5944 18.011 15.2512 16.6044
1999 18.1495 18.3175 14.8979 16.6284
2000 17.9288 18.1766 15.0504 16.6178

Overwriting C:\myPyCode\data\sea_rain1_space.txt

In [110]:
pd.read_csv('C:\myPyCode\data\sea_rain1_space.txt', sep=" ")   # csv파일이 아니어도 불러올 수 있음.

     연도       동해       남해       서해       전체
0  1996  17.4629  17.2288  14.4360  15.9067
1  1997  17.4116  17.4092  14.8248  16.1526
2  1998  17.5944  18.0110  15.2512  16.6044
3  1999  18.1495  18.3175  14.8979  16.6284
4  2000  17.9288  18.1766  15.0504  16.6178

In [111]:
pd.read_csv('C:/myPyCode/data/sea_rain1.csv', index_col="연도" )   # '연도'라는 column 추가

           동해       남해       서해       전체
연도
1996  17.4629  17.2288  14.4360  15.9067
1997  17.4116  17.4092  14.8248  16.1526
1998  17.5944  18.0110  15.2512  16.6044
1999  18.1495  18.3175  14.8979  16.6284
2000  17.9288  18.1766  15.0504  16.6178

#### 표 형식의 데이터를 파일로 쓰기

In [112]:
df_WH = pd.DataFrame({'Weight':[62, 67, 55, 74],
                      'Height':[165, 177, 160, 180]},
                       index=['ID_1', 'ID_2', 'ID_3', 'ID_4'])
df_WH.index.name = 'User'   # 'User' 라는 index.name 으로 설정
df_WH

      Weight  Height
User
ID_1      62     165
ID_2      67     177
ID_3      55     160
ID_4      74     180

In [113]:
bmi = df_WH['Weight']/(df_WH['Height']/100)**2
bmi

User
ID_1    22.773186
ID_2    21.385936
ID_3    21.484375
ID_4    22.839506
dtype: float64

In [114]:
df_WH['BMI'] = bmi
df_WH

      Weight  Height        BMI
User
ID_1      62     165  22.773186
ID_2      67     177  21.385936
ID_3      55     160  21.484375
ID_4      74     180  22.839506

In [115]:
df_WH.to_csv('C:/myPyCode/data/save_DataFrame.csv') # 추가된 데이터가 있으므로 csv 파일로 중간 저장

In [116]:
!type C:\myPyCode\data\save_DataFrame.csv #파일 확인

User,Weight,Height,BMI
ID_1,62,165,22.77318640955005
ID_2,67,177,21.38593635289987
ID_3,55,160,21.484374999999996
ID_4,74,180,22.839506172839506

In [117]:
df_pr = pd.DataFrame({'판매가격':[2000, 3000, 5000, 10000],
                       '판매량':[32, 53, 40, 25]},
                       index=['P1001', 'P1002', 'P1003', 'P1004'])
df_pr.index.name = '제품번호'
df_pr

        판매가격  판매량
제품번호
P1001   2000   32
P1002   3000   53
P1003   5000   40
P1004  10000   25

In [118]:
file_name = 'C:/myPyCode/data/save_DataFrame_cp949.txt'
df_pr.to_csv(file_name, sep=" ", encoding = "cp949")

In [119]:
!type C:\myPyCode\data\save_DataFrame_cp949.txt

제품번호 판매가격 판매량
P1001 2000 32
P1002 3000 53
P1003 5000 40
P1004 10000 25